package com.taobao.ibalance.zhitongche;

import java.util.ArrayList;
import java.util.Arrays;
import java.util.Collections;
import java.util.Iterator;
import java.util.List;

public class KeywordsInital {
	private static List<String> list = new ArrayList<String>(Arrays.asList("半身裙", "纱裙半身裙春夏", "牛仔裙", "a字裙半身裙", "百褶裙",
			"短裙", "中长款半身裙", "牛仔裙半身裙", "半身长裙", "女半身裙", "半身裙 长裙", "牛仔半身裙", "a字裙", "半身裙 夏", "包臀裙", "纱裙 半身裙", "百褶裙 半身裙",
			"网纱蓬蓬裙", "蕾丝半身裙", "包臀裙半身裙", "网纱半身裙", "长裙", "短裙春秋百搭半身裙高腰a字裙", "裙半身裙", "纱裙", "粉色网纱半身裙", "百褶半身长裙女", "高腰半身裙",
			"不规则半身裙", "牛仔短裙", "韩版裙", "网纱长裙半身裙", "排扣牛仔半身裙", "鱼尾裙 半身裙", "半身裙短裙", "短裙 夏 女", "包臀超短裙", "裙子", "女短裙", "百褶裙 短裙",
			"裙 半身 春秋", "一步裙", "雪纺半身裙", "牛仔a字裙", "纱裙半身裙 大码", "长款纱裙半身裙", "半身裙 春", "蕾丝一步裙", "女装", "职业包裙", "防走光短裙",
			"碎花雪纺半身裙", "半身裙 蓬蓬裙", "黑色蓬蓬裙", "短裙 a字裙", "裙 春", "半身裙牛仔裙毛边", "包裙半身裙", "a字半身裙", "鱼尾裙", "碎花半身裙", "百褶裙短裙裙裤",
			"假两件短裙", "短裙春秋", "半身裙春季2017新款女 韩版 百搭", "棉麻半身长裙", "牛仔裙半身裙 中长款", "2017春新款裙", "半身a字伞裙", "女 裙 夏 半身裙", "格子半身裙",
			"半身裙女春2017新款 中长款", "防走光裙裤", "包裙", "短裙半身裙a字裙", "女中长款半身裙", "皮裙", "高腰半身伞裙", "牛仔裙 女", "品牌牛仔裙", "丝绒百褶裙",
			"黑色a字短裙", "职业装一步裙", "一步裙 韩版", "中长款牛仔裙", "不规则牛仔短裙", "裙 女 夏", "牛仔半身长裙", "中长裙", "网纱裙", "黑色半身裙", "百褶裙裤 短裙",
			"牛仔背带裙", "牛仔裙春季女2017新款韩版", "a字裙半身裙中长款", "中长纱裙", "包臀半身裙", "a字半身裙纱裙", "女裙", "网纱a字裙"));

	public static String shuffle() {
		Collections.shuffle(list);
		String shuffle = "";
		Iterator<String> ite = list.iterator();
		while (ite.hasNext()) {
			shuffle = shuffle + ite.next().toString() + " ";
		}

		return shuffle;
	}
}
